Revit 2027 API
KeyBasedTreeEntriesLoadContent Class
 This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their LoadResource method is invoked.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntriesLoadContent : ExternalResourceLoadContent
Public Class KeyBasedTreeEntriesLoadContent
	Inherits ExternalResourceLoadContent
public ref class KeyBasedTreeEntriesLoadContent : public ExternalResourceLoadContent
type KeyBasedTreeEntriesLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
The KeyBasedTreeEntriesLoadContent type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternalResourceLoadContent)
LoadStatus |  A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
(Inherited from ExternalResourceLoadContent)
Version |  The version of the external data that the server is providing in this object.
(Inherited from ExternalResourceLoadContent)
Top
Methods
Name | Description
AddEntry |  Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
BuildEntries |  Builds a KeyBasedTreeEntries object.
CanAddEntry |  Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
Dispose
(Inherited from ExternalResourceLoadContent)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEntries |  Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLoadResults |  Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEntriesBuilt |  Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
Reset |  Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The class contains a KeyBasedTreeEntries object which should hold the KeyBasedTreeEntries data generated by the IExternalResourceServer.
An ExternalResourceServer can create the KeyBasedTreeEntries from an arbitrary data source by using AddEntry to add individual KeyBasedTreeEntries. Once all the desired entries have been added, BuildEntries can be called to construct the KeyBasedTreeEntries object from the individual entries that were added.
KeyBasedTreeEntriesLoadContent must have a built KeyBasedTreeEntries before its LoadStatus property can be set to ExternalResourceLoadStatus.Success.
See Also
Reference
Autodesk.Revit.DB Namespace